01_codes/OF_cases/airFlowV2/0.org/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

    outlet
    {
        type            zeroGradient;
        // type            inletOutlet;
        // inletValue      uniform (0 0 0);
        // value           $internalField;
    }

    lowerWall
    {
        // type            fixedValue;
        // value           $internalField;
        type noSlip;
    }

    "build1|build2|build3|build4"
    {
        type            noSlip;
    }

    // upperWall
    // {
    //     type slip;
    // }

    // frontAndBack
    // {
    //     type slip;
    // }

    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
