01_codes/OF_cases/airFlowV2/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $turbEps;

boundaryField
{
    inlet
    {
        // type            fixedValue;
        // value           $internalField;
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    $mixLenght;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
        // type            inletOutlet;
        // inletValue      uniform (0 0 0);
        // value           $internalField;
    }
    upperWall
    {
        type            slip;
    }
    lowerWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    "build1|build2|build3|build4"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    #include "include/frontBackUpperPatches"
}