01_codes/OF_cases/airFlowV2/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $inNutT;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    frontAndBack
    {
        type            calculated;
        value           uniform 0;
    }

    inlet
    {
        // type            calculated;
        // value           uniform 0;
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
        // type            calculated;
        // value           uniform 0;
    }

    lowerWall
    {
        // type            nutkRoughWallFunction;
        type            nutkWallFunction;
        value           $internalField;
    }

    upperWall
    {
        type            slip;
    }

    "build1|build2|build3|build4"
    {
        // type            nutkRoughWallFunction;
        type            nutkWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
